{
    "locations": [
        {
            "name": "Faranga",
            "description": "Faranga is a volcanic island, located at 21°19' North and 157°50' West. Although the climate is tropical, sub-climates and vegetation zones offer some variety. It is east of the Southern Seas archipelago, in the general vicinity of Gaurus, and is inhabited by different factions of humans.\n\nAfter the opening scene to Risen, the Castaway washes ashore on one of the island's western beaches. Shortly after his arrival, he heads inland with the only other survivor of the shipwreck. He leaves her at the first abandoned house they find and continues to try to find help. During his journeys, he learns that ancient temple ruins have risen from the ground all across the island, providing access to a network of interconnected underground areas such as catacombs and dungeons.\n\nNot long after the titans were released from their imprisonment, the Inquisition (possibly under orders of the King) arrived at Harbour Town, forcing the Don and his men into the swamp. The Inquisition forbids anyone from leaving \"their city\" or the island."
        },
        {
            "name": "Harbour Town",
            "description": "Harbour Town is the only town on the island of Faranga. The main gate is on the western side and the rear gate is on the north-eastern town wall. You can get into the town through the rear gate by speaking to the guard there and bribing him with 100 gold coins, you can also trade items with him. Once you get inside you will not be able to leave until you have done certain quests for either the Order or for the Don.\n\nNote: Actually it is quite possible to 'simply' jump over the town's outer walls, at the rear gate this is safer.\n\nThe town is split into three sections: the Gutters, the Harbour and the Merchant's district. The Gutters is a place for the refugees and other citizens, it is in the eastern part of Harbour Town. The Harbour is the dock area of the town, in the southern part. The Merchant's district is a place to buy equipment and other items, it is in the western part of the town.\n\nYour faction-based decisions in Harbour Town are central to defining your characters path in the game. You have to either support the Order or the Don. This will give you alternative routes out of the city. Aiding the Don's men will result in you gaining access to a secret exit which leads onto a beach near the front gate, whereas assisting the Commandant Carlos will allow you to simply leave via the two gates."
        },
        {
            "name": "Bandit Camp",
            "description": "The Bandit Camp or the Swamp Camp is situated in the North-West part of the risen island - a little west of the Volcano Keep. This is where Don Esteban along with his band of followers, took refuge after the Inquisition overran the island. The camp is situated in the middle of a marshland littered with an assortment of wildlife that came to life along with the rising of the temples (ruins) and surrounded by a mountains.\n\nThe Don himself has taken recluse in one such temple ruin and presides over a ever-increasing stockpile of gold (and artefacts) that his little \"army\" helps gather from all around. People don't see much of the Don and the day-to-day operations of the camp is overseen by his wife Rachel. At the opening of the game, things are in a big disarray at the camp with most of the workers absconding. Though Rachel is supposed to be in charge, it is Brogar who actually runs the camp and commands people in absence of the Don. He takes full advantage of this fact and extorts other members as every possible opportunity - starting from work allotment to \"protection\" money.\n\nThere are a whole bunch of trainers in this camp, who can help you being your fighting (both melee & ranged) and hunting skills up to a decent level before you have managed to gain admittance to the Harbour Town. One can also pick up on smithy, basic alchemy and thieving here."
        }
    ]
}